app/services/guest_services/reservations.rb

    def guest
      @guest ||= Guest.find_by(email: params[:email])
---
SELECT "guests".* FROM "guests" WHERE "guests"."email" = 'mrcbstmnte@ggmail.com' LIMIT 1