app/serializers/reservation_serializer.rb

SELECT "guests".* FROM "guests" WHERE "guests"."id" = 1 LIMIT 1
---
    params[:is_reservations]
  } do |entity|
    {
      email: entity.guest.email,
      first_name: entity.guest.first_name,
      last_name: entity.guest.last_name,
      phone_numbers: entity.guest.phone_numbers