lib/payloads/base.rb

INSERT INTO "guests" ("email", "first_name", "last_name", "phone_numbers", "created_at", "updated_at") VALUES ('wayne_woodbridge@bnb.com', 'Wayne', 'Woodbridge', '{639123456789}', '2023-02-23 07:51:58.527376', '2023-02-23 07:51:58.527376') RETURNING "id"
INSERT INTO "reservations" ("code", "guest_id", "start_date", "end_date", "nights", "guests", "adults", "children", "status", "currency", "payout_price", "security_price", "total_price", "created_at", "updated_at") VALUES ('YYY12345679', 6, '2021-03-12 00:00:00', '2021-03-16 00:00:00', 4, 4, 2, 2, 'pending', 'AUD', '3800.00', '500.00', '4300.00', '2023-02-23 06:03:32.060902', '2023-02-23 06:03:32.060902') RETURNING "code"
---
    def create_reservation
      @reservation = Reservation.create(
        {
          code: reservation_code,
          guest: @guest
        }.merge(reservation_entities)
      )

INSERT INTO "guests" ("email", "first_name", "last_name", "phone_numbers", "created_at", "updated_at") VALUES ('wayne_woodbridge2@bnb.com', 'Wayne', 'Woodbridge', '{639123456789}', '2023-02-25 08:41:18.744762', '2023-02-25 08:41:18.744762') RETURNING "id"
---
    def save_guest
      @guest = Guest.create(guest_entities)

UPDATE "reservations" SET "status" = 'pending', "updated_at" = '2023-02-23 05:52:25.265153' WHERE "reservations"."code" = 'XXX12345679'
---
    def update_reservation
      @reservation = @guest.reservations.update(reservation.id, reservation_entities)

SELECT "guests".* FROM "guests" WHERE "guests"."email" = 'wayne_woodbridge@bnb.com' LIMIT 1
---
    def guest
      @guest ||= Guest.find_by(email: guest_email)

SELECT "reservations".* FROM "reservations" WHERE "reservations"."code" = 'Wilson' LIMIT 1  [["code", "Wilson"], ["LIMIT", 1]]
---
    def reservation
      @reservation ||= Reservation.find_by(code: reservation_code)